InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеКурса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>35</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БазоваяВалюта</Name>
					<Comment>Валюта, по отношению к которой хранится курс</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КурсыВалют/Forms/ФормаЗаписи/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// РегистрСведений.КурсыВалют.ФормаЗаписи
//  
//Параметры формы:
//  стандартные
//  
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоНовый = Параметры.Ключ.Пустой();
	Элементы.БазоваяВалюта.Доступность = ЭтоНовый;
	Элементы.Валюта.Доступность        = ЭтоНовый;
	
	//Модифицированность = ЭтоНовый;
	Если ЗначениеЗаполнено(Запись.Валюта) И ЗначениеЗаполнено(Запись.Период) Тогда
		
		ТаблицаКурса = РегистрыСведений.КурсыВалют.СрезПоследних(Запись.Период, Новый Структура("Валюта,БазоваяВалюта", Запись.Валюта, Запись.БазоваяВалюта));
		Если ТаблицаКурса.Количество() > 0 Тогда
			Запись.Курс      = ТаблицаКурса[0].Курс;
			Запись.Кратность = ТаблицаКурса[0].Кратность;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЭтоНовый Тогда
		АвтоЗаголовок = Ложь;
		Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Курс валюты (%1)'"),
			Запись.Валюта);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Параметры.Ключ.Пустой()
		ИЛИ ТекущийОбъект.Период <> Параметры.Ключ.Период 
		ИЛИ ТекущийОбъект.Валюта <> Параметры.Ключ.Валюта 
		ИЛИ ТекущийОбъект.БазоваяВалюта <> Параметры.Ключ.БазоваяВалюта Тогда
		
		// Проверим уникальность записи
		МенеджерЗаписи = РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ТекущийОбъект);
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Выбран() Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Курс %1/%2 на %3 уже задан. Нельзя создать еще одну такую же запись.'"),
				МенеджерЗаписи.Валюта, МенеджерЗаписи.БазоваяВалюта, Формат(МенеджерЗаписи.Период, "ДЛФ=D"));
			Сообщить(ТекстСообщения);
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОбновленыКурсыВалют", Запись);
	
КонецПроцедуры



#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы



#КонецОбласти



#Область ОбработчикиКомандФормы



#КонецОбласти


#Область СлужебныеПроцедурыИФункции



#КонецОбласти
